app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-07-12 03:54:06.156712"], ["updated_at", "2018-07-12 03:54:06.156712"]]
---
  def create
    Post.create(title: params[:post][:title], description: params[:post][:description])